## Solution 1

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import os

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
# x=[]
# for i in df['From_To']:
#     x.append(i.title())
# df['From_To']=x

In [5]:
df = df.interpolate()

In [6]:
a=[]
for i in df["FlightNumber"]:
    i =int(i)
    a.append(i)
df["FlightNumber"] = a

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## solution 2

In [8]:
From = []
To = []
for i in df["From_To"]:
    From.append(i.split("_")[0])
    To.append(i.split("_")[1])

In [9]:
df["From"] = From
df["To"] = To

In [10]:
# df.drop("From_To", axis = 1 ,inplace = True)

In [11]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

## Solution 3

In [12]:
x = []
for i in df['From']:
    x.append(i.title())
df['From']=x
y = []
for i in df['To']:
    y.append(i.title())
df['To']=y

In [13]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

## Solution 4

In [14]:
df.drop("From_To", axis = 1 ,inplace = True)

In [15]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

## Solution 5

In [37]:
l=[]
for i in df["RecentDelays"]:
     l.append(len(i))

In [38]:
l.sort(reverse = True)
a = l[0]

In [39]:
for i in df["RecentDelays"]:
    while(len(i)!=a):
        i.append("NaN")

In [40]:
for j in range(a):
    df["Delays_"+str(j+1)] = [i[j] for i in df["RecentDelays"]]

In [41]:
df.drop("RecentDelays",axis = 1,inplace = True)

In [42]:
df

,FlightNumber,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045,KLM(!),London,Paris,23,47,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67,32,NaN